In [2]:
import pandas as pd
import sqlite3

In [3]:
con = sqlite3.connect('./renamedzippedData/im.db')
cursor = con.cursor()

In [4]:
IMDB_tables_db = pd.read_sql("""

SELECT *
FROM sqlite_master

""", con)

In [5]:
IMDB_tables_db

,type,name,tbl_name,rootpage,sql
0,table,movie_basics,movie_basics,2,"CREATE TABLE ""movie_basics"" (\n""movie_id"" TEXT..."
1,table,directors,directors,3,"CREATE TABLE ""directors"" (\n""movie_id"" TEXT,\n..."
2,table,known_for,known_for,4,"CREATE TABLE ""known_for"" (\n""person_id"" TEXT,\..."
3,table,movie_akas,movie_akas,5,"CREATE TABLE ""movie_akas"" (\n""movie_id"" TEXT,\..."
4,table,movie_ratings,movie_ratings,6,"CREATE TABLE ""movie_ratings"" (\n""movie_id"" TEX..."
5,table,persons,persons,7,"CREATE TABLE ""persons"" (\n""person_id"" TEXT,\n ..."
6,table,principals,principals,8,"CREATE TABLE ""principals"" (\n""movie_id"" TEXT,\..."
7,table,writers,writers,9,"CREATE TABLE ""writers"" (\n""movie_id"" TEXT,\n ..."

In [6]:
"""Use Everything from movie_basics_df: 



"""

'Use Everything from movie_basics_df: \n\n\n\n'

In [7]:
movie_basics_df = pd.read_sql("""

SELECT *
FROM movie_basics

""", con)

In [8]:
movie_basics_df

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
...,...,...,...,...,...,...
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146142,tt9916730,6 Gunn,6 Gunn,2017,116.0,None
146143,tt9916754,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,NaN,Documentary

In [9]:
directors_df = pd.read_sql("""

SELECT *
FROM directors

""", con)

directors_df.head()

    movie_id  person_id
0  tt0285252  nm0899854
1  tt0462036  nm1940585
2  tt0835418  nm0151540
3  tt0835418  nm0151540
4  tt0878654  nm0089502

In [10]:
known_for_df = pd.read_sql("""

SELECT *
FROM known_for

""", con)

known_for_df.head()

   person_id   movie_id
0  nm0061671  tt0837562
1  nm0061671  tt2398241
2  nm0061671  tt0844471
3  nm0061671  tt0118553
4  nm0061865  tt0896534

In [11]:
"""for movie akas, we do not need the attributes because it has a lot of random attributes. 

Types is also questionable. 

"""

'for movie akas, we do not need the attributes because it has a lot of random attributes. \n\nTypes is also questionable. \n\n'

In [12]:
movie_akas_df = pd.read_sql("""

SELECT *
FROM movie_akas

""", con)

movie_akas_df.head()

,movie_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,None,None,0.0
1,tt0369610,11,Jurashikku warudo,JP,None,imdbDisplay,None,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,None,imdbDisplay,None,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,None,None,short title,0.0
4,tt0369610,14,Jurassic World,FR,None,imdbDisplay,None,0.0

In [13]:
""" We need eveything from movie_ratings"""

' We need eveything from movie_ratings'

In [14]:
movie_ratings_df = pd.read_sql("""

SELECT *
FROM movie_ratings

""", con)

movie_ratings_df.head()

     movie_id  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [15]:
""" From persons, we will need the peroson id and their names.


"""

' From persons, we will need the peroson id and their names.\n\n\n'

In [16]:
persons_df = pd.read_sql("""

SELECT *
FROM persons

""", con)

persons_df.head()

,person_id,primary_name,birth_year,death_year,primary_profession
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator"

In [17]:
"""For principals, we will need the movie ID, person ID, category, category

We will need to research more into what is ordering. This was also on movie akas dateframe. 

"""

'For principals, we will need the movie ID, person ID, category, category\n\nWe will need to research more into what is ordering. This was also on movie akas dateframe. \n\n'

In [18]:
principals_df = pd.read_sql("""

SELECT *
FROM principals

""", con)

principals_df.head()

    movie_id  ordering  person_id  category       job        characters
0  tt0111414         1  nm0246005     actor      None       ["The Man"]
1  tt0111414         2  nm0398271  director      None              None
2  tt0111414         3  nm3739909  producer  producer              None
3  tt0323808        10  nm0059247    editor      None              None
4  tt0323808         1  nm3579312   actress      None  ["Beth Boothby"]

In [19]:
"""For writers, we will need both columns"""

'For writers, we will need both columns'

In [20]:
writers_df = pd.read_sql("""

SELECT *
FROM writers

""", con)

writers_df.head()

    movie_id  person_id
0  tt0285252  nm0899854
1  tt0438973  nm0175726
2  tt0438973  nm1802864
3  tt0462036  nm1940585
4  tt0835418  nm0310087

In [21]:
 """
 JAWAAD
 
 
 Which factors are important for gross?
 
     - Title 
     - Domestic Gross and year
     - Studio
     - Foreign Gross has too many null values, ignoring this column. 
"""

'\nJAWAAD\n\n\nWhich factors are important for gross?\n\n    - Title \n    - Domestic Gross and year\n    - Studio\n    - Foreign Gross has too many null values, ignoring this column. \n'

In [22]:
movie_gross = pd.read_csv("./renamedzippedData/bom.movie_gross.csv.gz")

In [23]:
movie_gross.isna().sum()

title                0
studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

In [24]:
movie_gross.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [25]:
"""

JAWAAD

What we need from Budget: 

    - ID
    - Movie
    - Release Date -  correlation for veiwership and season
    - Basically, everything is important







"""

'\n\nJAWAAD\n\nWhat we need from Budget: \n\n    - ID\n    - Movie\n    - Release Date -  correlation for veiwership and season\n    - Basically, everything is important\n\n\n\n\n\n\n\n'

In [26]:
movie_budget = pd.read_csv("./renamedzippedData/tn.movie_budgets.csv.gz")

In [27]:
movie_budget.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [28]:
"""
Marshall


For movie info, we are going to use these columns: 
    - Ratings
    -Genre
    - runtime 
    - theater date because we want to see a correlation if there are people who want to see movies in 
    certain seasons?
    - Currency and Box office has too many nulls. 

We are going to keep this separated and make a general dataframe. 
    - average rating
    - average runtime 
    - etc





"""

'\nMarshall\n\n\nFor movie info, we are going to use these columns: \n    - Ratings\n    -Genre\n    - runtime \n    - theater date because we want to see a correlation if there are people who want to see movies in \n    certain seasons?\n    - Currency and Box office has too many nulls. \n\nWe are going to keep this separated and make a general dataframe. \n    - average rating\n    - average runtime \n    - etc\n\n\n\n\n\n'

In [29]:
movie_info = pd.read_csv("./renamedzippedData/rt.movie_info.tsv.gz", sep = '\t')

In [30]:
movie_info.head()

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One
2,5,Illeana Douglas delivers a superb performance ...,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,"Sep 13, 1996","Apr 18, 2000",NaN,NaN,116 minutes,NaN
3,6,Michael Douglas runs afoul of a treacherous su...,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,"Dec 9, 1994","Aug 27, 1997",NaN,NaN,128 minutes,NaN
4,7,NaN,NR,Drama|Romance,Rodney Bennett,Giles Cooper,NaN,NaN,NaN,NaN,200 minutes,NaN

In [31]:
"""
MARSHALL


For movie reviews, we need: 
     - rating and review have a lot of nulls but we will dig deeper into this 


Come back to this.





"""

'\nMARSHALL\n\n\nFor movie reviews, we need: \n     - rating and review have a lot of nulls but we will dig deeper into this \n\n\nCome back to this.\n\n\n\n\n\n'

In [32]:
data_review = pd.read_csv('./renamedzippedData/rt.reviews.tsv.gz',sep='\t',encoding='unicode_escape')

In [33]:
data_review

,id,review,rating,fresh,critic,top_critic,publisher,date
0,3,A distinctly gallows take on contemporary fina...,3/5,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"
1,3,It's an allegory in search of a meaning that n...,NaN,rotten,Annalee Newitz,0,io9.com,"May 23, 2018"
2,3,... life lived in a bubble in financial dealin...,NaN,fresh,Sean Axmaker,0,Stream on Demand,"January 4, 2018"
3,3,Continuing along a line introduced in last yea...,NaN,fresh,Daniel Kasman,0,MUBI,"November 16, 2017"
4,3,... a perverse twist on neorealism...,NaN,fresh,NaN,0,Cinema Scope,"October 12, 2017"
...,...,...,...,...,...,...,...,...
54427,2000,The real charm of this trifle is the deadpan c...,NaN,fresh,Laura Sinagra,1,Village Voice,"September 24, 2002"
54428,2000,NaN,1/5,rotten,Michael Szymanski,0,Zap2it.com,"September 21, 2005"
54429,2000,NaN,2/5,rotten,Emanuel Levy,0,EmanuelLevy.Com,"July 17, 2005"
54430,2000,NaN,2.5/5,rotten,Christopher Null,0,Filmcritic.com,"September 7, 2003"
54431,2000,NaN,3/5,fresh,Nicolas Lacroix,0,Showbizz.net,"November 12, 2002"

In [34]:
""" 
Kyongmin


What we need in movies:
        - ID (all ID)
        - Title
        - Popularity - Play around with this data.
        - ?Date - Release Date?
        - Vote average 
        - Vote Count




"""

' \nKyongmin\n\n\nWhat we need in movies:\n        - ID (all ID)\n        - Title\n        - Popularity - Play around with this data.\n        - ?Date - Release Date?\n        - Vote average \n        - Vote Count\n\n\n\n\n'

In [81]:
movies = pd.read_csv("./renamedzippedData/tmdb.movies.csv.gz")

In [82]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26517 entries, 0 to 26516
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         26517 non-null  int64
 1   genre_ids          26517 non-null  object
 2   id                 26517 non-null  int64
 3   original_language  26517 non-null  object
 4   original_title     26517 non-null  object
 5   popularity         26517 non-null  float64
 6   release_date       26517 non-null  object
 7   title              26517 non-null  object
 8   vote_average       26517 non-null  float64
 9   vote_count         26517 non-null  int64
dtypes: float64(2), int64(3), object(5)
memory usage: 2.0+ MB

In [83]:
movies.keys()

Index(['Unnamed: 0', 'genre_ids', 'id', 'original_language', 'original_title',
       'popularity', 'release_date', 'title', 'vote_average', 'vote_count'],
      dtype='object')

In [85]:
movies

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186
...,...,...,...,...,...,...,...,...,...,...
26512,26512,"[27, 18]",488143,en,Laboratory Conditions,0.600,2018-10-13,Laboratory Conditions,0.0,1
26513,26513,"[18, 53]",485975,en,_EXHIBIT_84xxx_,0.600,2018-05-01,_EXHIBIT_84xxx_,0.0,1
26514,26514,"[14, 28, 12]",381231,en,The Last One,0.600,2018-10-01,The Last One,0.0,1
26515,26515,"[10751, 12, 28]",366854,en,Trailer Made,0.600,2018-06-22,Trailer Made,0.0,1
26516,26516,"[53, 27]",309885,en,The Church,0.600,2018-10-05,The Church,0.0,1

In [86]:
movies.drop(columns = ['Unnamed: 0', 'original_language'], inplace = True)

In [87]:
movies

,genre_ids,id,original_title,popularity,release_date,title,vote_average,vote_count
0,"[12, 14, 10751]",12444,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,"[14, 12, 16, 10751]",10191,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,"[12, 28, 878]",10138,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,"[16, 35, 10751]",862,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,"[28, 878, 12]",27205,Inception,27.920,2010-07-16,Inception,8.3,22186
...,...,...,...,...,...,...,...,...
26512,"[27, 18]",488143,Laboratory Conditions,0.600,2018-10-13,Laboratory Conditions,0.0,1
26513,"[18, 53]",485975,_EXHIBIT_84xxx_,0.600,2018-05-01,_EXHIBIT_84xxx_,0.0,1
26514,"[14, 28, 12]",381231,The Last One,0.600,2018-10-01,The Last One,0.0,1
26515,"[10751, 12, 28]",366854,Trailer Made,0.600,2018-06-22,Trailer Made,0.0,1
26516,"[53, 27]",309885,The Church,0.600,2018-10-05,The Church,0.0,1

In [97]:
movies = movies.sort_values('popularity', ascending = False)

In [98]:
movies

,genre_ids,id,original_title,popularity,release_date,title,vote_average,vote_count
23811,"[12, 28, 14]",299536,Avengers: Infinity War,80.773,2018-04-27,Avengers: Infinity War,8.3,13948
11019,"[28, 53]",245891,John Wick,78.123,2014-10-24,John Wick,7.2,10081
23812,"[28, 12, 16, 878, 35]",324857,Spider-Man: Into the Spider-Verse,60.534,2018-12-14,Spider-Man: Into the Spider-Verse,8.4,4048
11020,"[28, 12, 14]",122917,The Hobbit: The Battle of the Five Armies,53.783,2014-12-17,The Hobbit: The Battle of the Five Armies,7.3,8392
5179,"[878, 28, 12]",24428,The Avengers,50.289,2012-05-04,The Avengers,7.6,19673
...,...,...,...,...,...,...,...,...
7820,[27],410653,Undead Apocalypse,0.600,2012-07-01,Undead Apocalypse,2.0,1
7819,[35],468083,Fifty Shades of Blue,0.600,2012-05-22,Fifty Shades of Blue,2.0,3
7838,"[27, 18]",262267,Darkest Night,0.600,2012-10-20,Darkest Night,1.6,4
7862,"[10749, 18]",211652,Любовь в СССР,0.600,2012-12-20,Love in USSR,1.0,1
26516,"[53, 27]",309885,The Church,0.600,2018-10-05,The Church,0.0,1

In [ ]:
"""Subcategorize to genre - """